export const m = {
    label: {
        register: "登録",
        loginGame:"ログイン",
        close:"閉じる",
        ok:"確認",
        account:"アカウント",
        password:"パスワード",
        passwordRetry:"パスワード確認",
        nickName:"ニックネーム",
        guildName:"ギルドネーム",
        accountTx:"アバター",
        guildIcon:"ギルドアイコン",
        captcha:"キャプチャ",
        select:"選択",
        error:"エラー",
    },
    error:{
        front:{
            register:{
                "0":"2つのパスワードが異なります!",
                "1":"アカウントは、文字、数字、アンダースコア、マイナス記号のみが許可され、2〜16桁が必要です！",
                "2":"パスワードは文字、数字、アンダースコア、マイナス記号のみを許可し、4〜16桁の数字が必要です！",
                "3":"ニックネームは、中国語、日本語、英語、数字、アンダースコアを使用でき、2〜8文字である必要があります！",
                "4":"ギルドの名前は、中国語、日本語、英語、数字、アンダースコアを使用でき、2〜8文字である必要があります！",
                "5":"アバターを設置してください！",
                "6":"ギルドアイコンを設置してください！",
                "7":"キャプチャを入力してください！",
            }
        },
        backend:{
            register:{
                "0":"キャプチャが正しくありません！",
                "1":"アカウントは、文字、数字、アンダースコア、マイナス記号のみが許可され、2〜16桁が必要です！",
                "2":"パスワードは文字、数字、アンダースコア、マイナス記号のみを許可し、4〜16桁の数字が必要です！",
                "3":"ニックネームは、中国語、日本語、英語、数字、アンダースコアを使用でき、2〜8文字である必要があります！",
                "4":"ギルドの名前は、中国語、日本語、英語、数字、アンダースコアを使用でき、2〜8文字である必要があります！",
                "5":"画像のアップロードに失敗しました！",
                "6":"アカウントはすでに存在しています",
                "7":"ニックネームはすでに存在します",
                "8":"ギルド名はすでに存在します",
            }
        }
    }
};
  