export const m = {
  label: {
    register: "注册",
    loginGame: "登录",
    close: "关闭",
    ok: "确定",
    account: "账号",
    password: "密码",
    passwordRetry: "密码确认",
    nickName: "昵称",
    guildName: "公会名",
    accountTx: "头像",
    guildIcon: "工会图标",
    captcha: "验证码",
    select: "选择",
    error: "错误",
    login: "登录",
    saveLoginInfo: "保存登录信息"
  },
  error: {
    code: {
      "403": "token已失效，请重新登录"
    },
    front: {
      register: {
        "0": "两次密码不同!",
        "1": "请输入2-16位英数字下划线减号的账号！",
        "2": "请输入4-16位英数字下划线减号的密码！",
        "3": "请输入2-12位的昵称！",
        "4": "请输入2-12位的公会名称！",
        "5": "请设置会长头像！",
        "6": "请设置公会图标！",
        "7": "请输入验证码！"
      }
    },
    backend: {
      register: {
        "0": "验证码有误！",
        "1": "请输入2-16位英数字下划线减号的账号！",
        "2": "请输入4-16位英数字下划线减号的密码！",
        "3": "请输2-8位中文、日文、英文、数字、下划线的昵称！",
        "4": "请输入2-8位中文、日文、英文、数字、下划线的公会名称！",
        "5": "图片上传失败！",
        "6": "账号已存在",
        "7": "昵称已存在",
        "8": "公会名称已存在"
      },
      login: {
        "0": "验证码有误！",
        "1": "请输入账号",
        "2": "请输入密码",
        "3": "账户或密码不正确！"
      }
    }
  }
};
